:PROPERTIES:
:ID:       38638b3e-e023-460e-9670-84776e61468e
:END:
#+title: Browser
#+CATEGORY: topics
#+TAGS:


***** SingletonLock

These files are used to determine state so only one governing process can
write to a profile's data at any time.

See [[https://chromium.googlesource.com/chromium/src/+/HEAD/chrome/browser/process_singleton_posix.cc][./src/chrome/browser/process_singleton_posix.cc]]

#+begin_src shell :results output verbatim
ls -al $(fd 'Singleton' ~/.config/chromium)
#+end_src

#+RESULTS:
: lrwxrwxrwx 1 dc dc 19 Oct 21 19:01 /home/me/.config/chromium/SingletonCookie -> 0891672785766630363
: lrwxrwxrwx 1 dc dc 13 Oct 21 19:01 /home/me/.config/chromium/SingletonLock -> muhhost-111996
: lrwxrwxrwx 1 dc dc 50 Oct 21 19:01 /home/me/.config/chromium/SingletonSocket -> /tmp/.org.chromium.Chromium.akBre/SingletonSocket

**** Enumeration

Anyways, they're in =.org.chromium.Chromium.*=
#+name: qProfiles
#+begin_example jq
[..
  | paths(type == "string" and test("^(profile |default).*"; "i"))]
  | map(join("/")) | join("\n")
#+end_example

lol dammit =paste= (trying to get this to line up horizontally, but calculating
column width and correcting tabs requires extracting the max column of each
result)

#+begin_src shell :var q=qProfiles :results output code :wrap example
# find ~/.config/chromium -maxdepth 1 -type f -name '.org.chromium.Chromium.*' -printf '%p\n'
declare -a profs
profs=() # dammit bash
for p in $(find ~/.config/chromium -maxdepth 1 -type f -name '.org.chromium.Chromium.*' -printf '%p\n'); do
    profs+=($p)
done

paste -d"\t" <(jq -r "$q" ${profs[0]} | tree --noreport --fromfile .) \
    <(jq -r "$q" ${profs[1]} | tree --noreport --fromfile .) \
    <(jq -r "$q" ${profs[2]} | tree --noreport --fromfile .) \
    <(jq -r "$q" ${profs[3]} | tree --noreport --fromfile .) \
    | sed -e 's/\t/\t\t/g'

# fd -Ht f '.org.chromium.Chromium..*' ~/.config/chromium | tr ' ' '\n'
#+end_src

#+RESULTS:
#+begin_example
.		.		.		.
├── 0		├── 0		├── 0		├── 0
├── 1		├── 1		├── 1		├── 1
├── last_used		├── last_used		├── 2		├── 2
├── profile		├── profile		├── last_active_profiles		├── 3
│   ├── last_used		│   ├── last_used		│   └── 0		├── last_active_profiles
│   └── profiles_order		│   └── profiles_order		├── last_used		│   └── 0
│       ├── 0		│       ├── 0		├── profile		├── last_used
│       └── 1		│       └── 1		│   ├── last_active_profiles		├── profile
└── profiles_order		└── profiles_order		│   │   └── 0		│   ├── last_active_profiles
    ├── 0		    ├── 0		│   ├── last_used		│   │   └── 0
    └── 1		    └── 1		│   └── profiles_order		│   ├── last_used
                                │       ├── 0		│   └── profiles_order
                                │       ├── 1		│       ├── 0
                                │       └── 2		│       ├── 1
                                └── profiles_order		│       ├── 2
                                    ├── 0		│       └── 3
                                    ├── 1		└── profiles_order
                                    └── 2		    ├── 0
                                                    ├── 1
                                                    ├── 2
                                                    └── 3
#+end_example

=paste= is about as useful as it looks above, unless maybe using =paste -s= instead
of many =tee -a >(*・_・)ノ⌒᠁💻|= Anyways

#+begin_src shell :var q=qProfiles :results output code :wrap example
jq -r "$q" $(find ~/.config/chromium -maxdepth 1 -type f -name '.org.chromium.Chromium.*' -printf '%p\n' | head -n1) \
    | tree --noreport --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
├── 0
├── 1
├── last_used
├── profile
│   ├── last_used
│   └── profiles_order
│       ├── 0
│       └── 1
└── profiles_order
    ├── 0
    └── 1
#+end_example

Well damn. is that right? [[https://stackoverflow.com/questions/20458406/what-is-the-format-of-chromes-timestamps][Format of chrome timestamps]]

#+begin_example jq
[.. | objects | paths(type == "object" and  has("enabled_time"))]
#+end_example

Well everyone else has deleted all their accounts & data... not much is left.
Censored today? Maybe. Censored in the future? lol
***** Locating
Some fake App IDs, the second one generated from the first with =C-u M-| rev=

#+name: crxAppIds2
#+begin_example
cefklejpffnngppfdbepnoghkbihdpji
ijpdhibkhgonpebdfppgnnffpjelkfec
#+end_example

The app ids result from a truncated hex SHA256, shifted from =[0-9a-f]= to =[a-p]=

#+name: noncedCrxAppIds
#+begin_src shell :var appIds=crxAppIds2
for id in $appIds; do
    echo $id | sha256sum | tr '01234567890abcdef' 'abcdefghijklmnop' | head -c32
    echo
done
#+end_src

#+RESULTS: noncedCrxAppIds
| ecjcmfmhnjicjhckhnkinbpppgbebjjp |
| obfcmpcgoboicbpbhehppkociimjmipd |



***** Minilayout repos

The checkout used by AUR is pretty large and needs submodules. For chromiumos,
the instructions are in [[https://www.chromium.org/chromium-os/developer-library/guides/development/work-on-branch/#check-out-the-whole-tree-with-repo][ChromiumOS Guide to Working on Branches]] but it mentions
a =minilayout= group. This includes =depot_tools= which sounds familiar... but it's
definitely just =chromiumos=

:PROPERTIES:
:header-args+: :dir /tmp/tmp.gCH5ekm9XQ
:END:

After git =clone https://chromium.googlesource.com/chromiumos/manifest.git=

Without =repo init=, these are the gruops. it doesn't require the full sync

#+begin_src shell :results output table
grep -re groups= manifest/full.xml | sed -E 's/ +groups="(.*)".*/\1/g' | tr ',' '\n' | sort | uniq #| tr '\n' ','
#+end_src

#+RESULTS:
| bazel                |
| bluetooth            |
| buildtools           |
| chromeos-admin       |
| config               |
| crostini             |
| crosvm               |
| devserver            |
| firmware             |
| fwsdk                |
| kcam                 |
| labtools             |
| minilayout           |
| moblab               |
| notdefault           |
| partner-config       |
| paygen               |
| satlab               |
| sysmon               |
| ti50                 |
| touch-firmware-tests |
| xolabs               |
| zephyr               |

#+name: jqProjByGroup
#+begin_example jq
.manifest.project[]
| select((."@groups" // "")
  | test($group))

# | map({.project: .})
#+end_example

it's PITA to rewrap .project with manifest. =xq= doesn't jive with =DTD= anyways.

#+name: crProjByGroup
#+begin_src shell :results output code :wrap example xml :var q=jqProjByGroup group="minilayout"
echo '<manifest>'
xq -x --xml-root=project --arg 'group' "$group" "$q" manifest/full.xml \
  | tidy -iq --tidy-mark no -w 0 --show-body-only auto --doctype omit -xml
# meh, it's in the notes. same output.
echo '</manifest>'
#+end_src

#+RESULTS:
#+begin_example xml
<manifest>
<project path="src/repohooks" name="chromiumos/repohooks" groups="minilayout,paygen,firmware,buildtools,labtools,crosvm,fwsdk,ti50"></project>
<project path="chromite" name="chromiumos/chromite" groups="minilayout,paygen,firmware,buildtools,chromeos-admin,labtools,sysmon,devserver,crosvm,fwsdk,ti50">
  <copyfile src="AUTHORS" dest="AUTHORS"></copyfile>
  <copyfile src="LICENSE" dest="LICENSE"></copyfile>
</project>
<project path="src/overlays" name="chromiumos/overlays/board-overlays" groups="minilayout,paygen,firmware"></project>
<project path="src/platform/empty-project" name="chromiumos/infra/build/empty-project" revision="d2d95e8af89939f893b1443135497c1f5572aebc" groups="minilayout,paygen,firmware">
  <annotation name="branch-mode" value="pin"></annotation>
</project>
<project path="src/scripts" name="chromiumos/platform/crosutils" groups="minilayout,paygen,firmware,buildtools,labtools,ti50"></project>
<project path="src/third_party/pyelftools" name="chromiumos/third_party/pyelftools" revision="refs/heads/chromeos-0.22" groups="minilayout,paygen,firmware,buildtools"></project>
<project path="bazel_deps/bazel-central-registry" name="external/github.com/bazelbuild/bazel-central-registry" revision="refs/heads/upstream/main" groups="minilayout,bazel,fwsdk,firmware,ti50"></project>
<project path="bazel_deps/rules_cc" name="chromiumos/third_party/rules_cc" groups="minilayout,bazel,fwsdk,firmware,ti50"></project>
<project path="bazel_deps/rules_pkg" name="chromiumos/third_party/rules_pkg" groups="minilayout,bazel,fwsdk,firmware,ti50"></project>
<project path="bazel_deps/rules_rust" name="chromiumos/third_party/rules_rust" groups="minilayout,bazel,fwsdk,firmware,ti50"></project>
<project path="src/bazel" name="chromiumos/bazel" groups="minilayout,bazel,fwsdk,firmware,ti50">
  <linkfile src="workspace_root/general/WORKSPACE" dest="src/WORKSPACE"></linkfile>
</project>
<project path="src/platform2" name="chromiumos/platform2" groups="minilayout,paygen,crosvm,config,partner-config"></project>
<project path="src/platform/crostestutils" name="chromiumos/platform/crostestutils" groups="minilayout,paygen,firmware,buildtools"></project>
<project path="src/platform/dev" name="chromiumos/platform/dev-util" groups="minilayout,paygen,firmware,buildtools,devserver"></project>
<project path="src/platform/tast" name="chromiumos/platform/tast" groups="minilayout,paygen,ti50"></project>
<project path="src/platform/tast-tests" name="chromiumos/platform/tast-tests" groups="minilayout,paygen,ti50"></project>
<project path="src/third_party/chromiumos-overlay" name="chromiumos/overlays/chromiumos-overlay" groups="minilayout,paygen,firmware,labtools,ti50" sync-c="true"></project>
<project path="src/third_party/eclass-overlay" name="chromiumos/overlays/eclass-overlay" groups="minilayout,paygen,firmware,labtools"></project>
<project path="src/third_party/gtest-parallel" name="external/github.com/google/gtest-parallel" revision="cd488bdedc1d2cffb98201a17afc1b298b0b90f1" groups="minilayout"></project>
<project path="src/third_party/portage-stable" name="chromiumos/overlays/portage-stable" groups="minilayout,paygen,firmware,labtools"></project>
<project path="src/third_party/toolchain-utils" name="chromiumos/third_party/toolchain-utils" groups="minilayout,paygen,firmware"></project>
<project path="src/third_party/toolchains-overlay" name="chromiumos/overlays/toolchains" groups="minilayout,paygen,firmware,labtools"></project>
<project path="src/chromium/depot_tools" remote="chromium" name="chromium/tools/depot_tools" revision="9e30d926fd13430266b3c0141b45790874e2fab3" groups="minilayout,paygen,firmware,buildtools,labtools,ti50"></project>
</manifest>
#+end_example


*** IDL
IDL specs are in repo: [[https://github.com/w3c/webref/tree/main/ed/idl][w3c/webref]] and collected by crawling with [[https://github.com/w3c/reffy][w3c/reffy]],
which produces the provenance for all the Web APIs is documented in the parent
folder at [[https://github.com/w3c/webref/blob/main/ed/index.json][./ed/index.json]]. There's also [[https://w3c.github.io/webref/ed/idlnames.json][.tr/idlnames.json]], but this hasn't been
updated in a few years (afaik...).

This gist gives an idea of how the data may be used

#+begin_src shell :results output verbatim code :wrap example javascript
curl -s https://gist.githubusercontent.com/dontcallmedom/4ce7183bd1ac9d6bf79ae11da12f1898/raw/35dd381295e1b22b90c50a338020b6d84b626d2c/update-interface-data.js
#+end_src

#+RESULTS:
#+begin_example javascript
const fs = require("fs").promises;

// @@@ download latest tagged version of @webref/idl repo
const webrefPath = "../../webref/ed/";
(async function () {
  const interfaceData = {};
  const index = JSON.parse(await fs.readFile(webrefPath + "idlnames.json", "utf-8"));
  (await Promise.all(
    Object.entries(index)
      .sort(([k1, v1], [k2, v2]) => k1.localeCompare(k2))
      .map(async ([,{parsed: jsonIdlPath}]) => await fs.readFile(webrefPath + jsonIdlPath, "utf-8"))
  )).forEach(jsonData => {
    const jsonIdl = JSON.parse(jsonData);
    if (jsonIdl.type === "interface" || jsonIdl.type === "interface mixin") {
      interfaceData[jsonIdl.name] = {
        inh: jsonIdl.inheritance?.name || "",
        impl: jsonIdl.includes.map(i => i.name)
      };
    }
  });
  console.log(JSON.stringify(interfaceData, null, 2));
})();
#+end_example


**** Every time i install a new browser/profile

I would love to enter these shortcuts in one at a time, which for an extension
which itself should've probably just been a feature in 2010. All browsers have
these problems and actually finding what files contain info like this doesn't
show up on Google.

#+name: ffshortcuts-for-extension
#+headers: :results output
#+headers: :var extension="treestyletab@piro.sakura.ne.jp"
#+headers: :in-file (expand-file-name "extension-settings.json" ffactivepath)
#+begin_src jq :cmd-line "-rj"
# with_entries(select(.value.Default == "1"))
.commands # | to_entries
  | map_values(.precedenceList | first)
  | map_values(select(.id == $extension and (.value.shortcut | length) > 0))
  | with_entries({"key": .key, "value": .value.value.shortcut})

#+end_src

#+RESULTS: ffshortcuts-for-extension
#+begin_example
{
  "treeMoveUp": "Ctrl+Alt+K",
  "treeMoveDown": "Ctrl+Alt+J",
  "focusPreviousSilently": "Ctrl+Alt+W",
  "focusNextSilently": "Ctrl+Alt+S",
  "focusParent": "Ctrl+Alt+H",
  "newChildTab": "Ctrl+Alt+T",
  "focusFirstChild": "Ctrl+Alt+L",
  "closeDescendants": "Ctrl+Alt+Q",
  "newContainerTab": "Ctrl+F1"
}
#+end_example

All browsers have neutered functionality. It's not Firefox or Chrome or
whatever. These are applications designed for corporations, not you the user.

*** Sqlite

Hmmmm.... wow. i can haz that?

[[id:0c386ed6-5a9d-4fc0-8444-550fce2c39a4][Org-babel with more detail here]]. It's honestly more of a feature than a bug, but
the data maybe ummm should be encrypted. [[https://jhoneill.github.io/powershell/2020/11/23/Chrome-Passwords.html][Same thing]] in [[https://developer.chrome.com/blog/deprecating-web-sql/][Chromium]].
Surprise. You're naked if anyone gets a shell to your environment ... with read
access to =$HOME=. Big deal. No passwords, but yeh... does it matter? It's being
phased out... but until then, have a fig leaf.

#+begin_src shell :results output list
ffdata="$HOME/.mozilla/firefox"
ffprofile=$(grep -e "^Default=.*" $ffdata/profiles.ini | head -n1 | cut -f2 -d'=')

cd $ffdata/$ffprofile
ls *.sqlite
#+end_src

#+RESULTS:
#+begin_example
- content-prefs.sqlite
- cookies.sqlite
- credentialstate.sqlite
- favicons.sqlite
- formhistory.sqlite
- permissions.sqlite
- places.sqlite
- protections.sqlite
- storage.sqlite
- storage-sync-v2.sqlite
- webappsstore.sqlite
#+end_example

